import re
with open('text.txt', 'r', encoding='utf-8') as file:
    tex = file.read()


# reg1 = r"[А-я]+ [А-я]+" # нашел слово (Три богатыря)
# reg11 = r"\w+\s[А-я]+" # нашел слово (Три богатыря)
# reg2 = r"[А-Я]{2,9}" # нашел слово (ГТО)
# reg3 = r"\b(?:[а-я]+)+\b" # нашел слово (стриж) и еще почемуто (богатыря)
# reg31 = r"\b[а-я]+\b" # нашел слово (стриж) и еще почемуто (богатыря)
# reg4 = r"\w+\d\w+" # нашел слово (агент007)
# reg5 = r"[А-Я]\w+|\w+[А-Я]+\w+|\w+[А-Я]" #
# reg6 = r"([А-Яа-я]*)([А-Я]{1})*([А-Яа-я]*)" #
reg7 = r"\b[А-Я]{1}[а-я]+\b|\b[а-я]*[А-Я]{1}[а-я]*\b|\b[а-я]*[А-Я]{1}[^\s]\b" #
reg8 = r'\b([А-я]+ [А-я]+)\b(.*)$'
reg9 = r'\w\s'
reg10 = r'\w{4}'

result = re.findall(reg7, tex)

print(result)


